loadtest/scenarios/load.yml
# ──────────────────────────────────────────────
# LOAD TEST  –  10 000 concurrent virtual users
#
# Phases:
#   1. Warm-up   : 0 → 200  VUs over 60 s
#   2. Ramp-up   : 200 → 2 000 VUs over 120 s
#   3. Peak      : 2 000 → 10 000 VUs over 180 s
#   4. Sustain   : hold 10 000 VUs for 300 s (5 min)
#   5. Ramp-down : 10 000 → 0 VUs over 60 s
# ──────────────────────────────────────────────

config:
  target: "http://localhost:3001"
  phases:
    - name:        "Warm-up"
      duration:    60
      arrivalRate: 3          # ~200 VUs after 60 s

    - name:        "Ramp-up"
      duration:    120
      arrivalRate: 15         # ramps to ~2 000 VUs

    - name:        "Peak ramp"
      duration:    180
      arrivalRate: 65         # pushes toward 10 000 VUs

    - name:        "Sustain 10k"
      duration:    300
      arrivalRate: 0          # no new arrivals; existing VUs stay alive
      maxVusers:   10000

    - name:        "Ramp-down"
      duration:    60
      arrivalRate: 0

  # Capture metrics into a JSON report
  output: "loadtest-report.json"

  engines:
    socketio-v3: {}

  socketio-v3:
    transports:
      - websocket           # force WS, skip long-poll upgrade
    extraHeaders:
      origin: "http://localhost:3000"

  processor: "../processor.js"

  # Thresholds – test fails if these are breached
  ensure:
    p99: 2000               # 99th-pct response < 2 s
    maxErrorRate: 1         # error rate < 1 %

scenarios:
  - name: "Regular chat user"
    weight: 70              # 70 % of VUs follow this path
    engine: socketio-v3
    flow:
      - emit:
          channel: "find-match"
          data: {}

      # Wait for match (or timeout → still in waiting queue)
      - on:
          channel: "matched"
          fn: "onMatched"
          timeout: 8000

      # Simulate reading / watching video
      - think: "{{ $randomNumber(5, 30) }}"

      # Send a few chat messages
      - loop:
          - fn: "sendChatMessage"
          - think: "{{ $randomNumber(1, 5) }}"
        count: "{{ $randomNumber(1, 5) }}"

      # Skip to next person
      - emit:
          channel: "skip"
          data: {}

      # Possibly chat again after skip
      - on:
          channel: "matched"
          fn: "onMatched"
          timeout: 8000

      - think: "{{ $randomNumber(5, 20) }}"

      # Stop and stay idle (simulates user pausing)
      - emit:
          channel: "stop"
          data: {}

      - think: "{{ $randomNumber(5, 15) }}"

  - name: "Quick skipper"
    weight: 20              # 20 % of VUs – skip rapidly
    engine: socketio-v3
    flow:
      - loop:
          - emit:
              channel: "find-match"
              data: {}
          - on:
              channel: "matched"
              fn: "onMatched"
              timeout: 5000
          - think: "{{ $randomNumber(1, 3) }}"
          - emit:
              channel: "skip"
              data: {}
          - think: 1
        count: "{{ $randomNumber(3, 8) }}"

  - name: "Long session user"
    weight: 10              # 10 % of VUs – stay connected a long time
    engine: socketio-v3
    flow:
      - emit:
          channel: "find-match"
          data: {}

      - on:
          channel: "matched"
          fn: "onMatched"
          timeout: 10000

      - think: "{{ $randomNumber(60, 120) }}"

      - loop:
          - fn: "sendChatMessage"
          - think: "{{ $randomNumber(3, 10) }}"
        count: "{{ $randomNumber(5, 15) }}"

      - emit:
          channel: "stop"
          data: {}