loadtest/scenarios/smoke.yml
# ──────────────────────────────────────────────
# SMOKE TEST  –  50 users, quick sanity check
# Run first to make sure the server is reachable
# and the Socket.io events work end-to-end.
# ──────────────────────────────────────────────

config:
  target: "http://localhost:3001"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
      name: "Ramp to 50 users"
  plugins:
    expect: {}
  engines:
    socketio-v3: {}
  socketio-v3:
    transports:
      - websocket
    extraHeaders:
      origin: "http://localhost:3000"
  processor: "../processor.js"

scenarios:
  - name: "Connect → find-match → chat → skip → disconnect"
    engine: socketio-v3
    flow:
      # 1. Connected – server registers the socket in `users`
      - emit:
          channel: "find-match"
          data: {}

      # 2. Wait up to 5 s for either 'matched' or 'waiting'
      - on:
          channel: "matched"
          fn: "onMatched"
          timeout: 5000

      # 3. Pause a moment (simulates the user reading/video)
      - think: 2

      # 4. Skip to next person
      - emit:
          channel: "skip"
          data: {}

      # 5. Stay connected a bit longer then disconnect naturally
      - think: 3