loadtest/scenarios/stress.yml
# ──────────────────────────────────────────────
# STRESS TEST  –  push past 10k to find the
# breaking point.  Run AFTER the load test.
# ──────────────────────────────────────────────

config:
  target: "http://localhost:3001"
  phases:
    - name:        "Steady climb"
      duration:    600        # 10 minutes
      arrivalRate: 20
      rampTo:      200        # ~20 000 by the end

  output: "stress-report.json"

  engines:
    socketio-v3: {}

  socketio-v3:
    transports:
      - websocket
    extraHeaders:
      origin: "http://localhost:3000"

  processor: "../processor.js"

scenarios:
  - name: "Stress user"
    engine: socketio-v3
    flow:
      - emit:
          channel: "find-match"
          data: {}

      - on:
          channel: "matched"
          fn: "onMatched"
          timeout: 10000

      - think: "{{ $randomNumber(10, 60) }}"

      - emit:
          channel: "skip"
          data: {}

      - think: "{{ $randomNumber(5, 20) }}"